// - Дано натуральное число n. Выведите все числа от 1 до n.
let natural=(n)=>{
    if (n >0 && n%1===0){
        console.log(n)
    }
    else {
        console.log('Це число не натуральне')
    }
}
natural(24)



// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B,
// или в порядке убывания в противном случае.
//
let fnnaturalAB=(a,b)=>{
    if (a<b){
        for (i=a;i<=b;i++){
            console.log(i)
        }

    }
    else if (a>b){
        for (i=a;i>=b;i--){
            console.log(i)
        }
    }
}
fnnaturalAB(30,23)


//
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
let foo=[9,8,0,4]
let afnarrayI=(array,i)=>{
    let  number=[]

    let j;
    for (j = 0; j < array.length; j++) {
        if (j = i) {
            j = j + 1
        }
        number[number.length] = array[j]
    }
    console.log(number)
}
afnarrayI(foo,0)


// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
